{
  "note": "以下为示例道具列表，AI可根据需求自行生成更多类似道具。(The following are example prop lists; the AI can generate additional similar props as needed.)",
  "categories": [
    {
      "name": "色情歌舞 (Erotic Dance) - 为色情舞蹈表演与训练设计的道具，带来拘束感、被掌控感与快感 (Props designed for erotic dance performances and training, delivering restraint, control, and pleasure)",
      "items": [
        {
          "name": "舞欲流光裙 (Dance Lust Glow Skirt)",
          "description": "A glowing skirt that binds the thighs with tightening fibers during spins, controlled remotely to dictate movement pace, while vibrators pulse at the hips for intense pleasure with each step."
        },
        {
          "name": "芭蕾魅惑足环 (Ballet Seduction Anklet)",
          "description": "A lace anklet with locking clasps that restrict ankle flexibility, enforcing submissive pointe positions under a controller’s command, with vibrating bells delivering teasing pleasure per leap."
        },
        {
          "name": "旗袍情丝腰带 (Qipao Lust Silk Belt)",
          "description": "A silk sash that cinches the waist tightly to limit sway range, controlled by hidden cords to enforce a slow, obedient gait, with weighted beads massaging the hips for constant pleasure."
        },
        {
          "name": "巫女灵缚铃带 (Miko Spirit Binding Bell Strap)",
          "description": "A strap that binds the thighs and torso with tightening bells, remotely triggered to restrict ritualistic bows, while vibrations at the spine heighten pleasure with each controlled gesture."
        },
        {
          "name": "肚皮舞欲纱腰链 (Belly Dance Lust Veil Chain)",
          "description": "A chain that locks around the hips with a firm grip, controlled to restrict shimmy speed, delivering rhythmic vibrations and teasing jolts of pleasure to enforce seductive isolations."
        },
        {
          "name": "拉丁热欲足链 (Latin Heat Lust Foot Chain)",
          "description": "A gold chain that shackles the ankles to limit stride length, controlled to enforce tight, submissive steps, with warming vibrators pulsing at the feet for pleasure during spins."
        },
        {
          "name": "弗拉门戈情焰裙摆 (Flamenco Passion Flame Skirt Hem)",
          "description": "A weighted hem with elastic bands that bind the calves tightly, controlled to restrict sharp turns, with vibrating pads igniting pleasure at each heel tap under a master’s rhythm."
        },
        {
          "name": "印度舞魂珠腕带 (Indian Dance Soul Bead Bracelet)",
          "description": "A beaded bracelet that locks wrists into submissive mudra poses, controlled by tension cords to guide gestures, with vibrating tassels delivering pleasure at the pulse points."
        },
        {
          "name": "波利尼西亚花欲腰环 (Polynesian Flower Lust Waist Ring)",
          "description": "A floral belt that constricts the hips with tightening vines, controlled to dictate slow, hypnotic sways, releasing pleasure-inducing vibrations and scents with each obedient motion."
        },
        {
          "name": "街舞诱惑颈带 (Street Dance Temptation Neck Strap)",
          "description": "A choker that tightens around the neck to enforce low, submissive drops, controlled remotely to limit head tilts, with pulsing LED accents sparking pleasure at each bold move."
        }
      ]
    }
  ]
}