缚手仰卧 (Bound Hands Supine)  
Description: The submissive lies flat on their back, wrists tied above their head with silk rope to a headboard or fixed point. Legs are spread wide, optionally bound to bedposts. The dominant kneels between their thighs, controlling penetration or teasing with toys, the taut ropes amplifying every squirm against the restraints.
跪地俯身 (Kneeling Forward Bend)  
Description: The submissive kneels on the floor, bending forward until their chest presses against their thighs, hands cuffed behind their back. The dominant stands or kneels behind, gripping hips for deep thrusts. A collar and leash can tug the neck, dictating rhythm and submission.
悬吊展翼 (Suspended Spread Eagle)  
Description: The submissive is hoisted by a ceiling harness, wrists and ankles bound to straps, body splayed like an X in midair. The dominant circles below, penetrating or teasing from any angle, the weightlessness heightening vulnerability as the body sways.
椅上屈膝 (Chair Kneel Bend)  
Description: The submissive sits on a sturdy chair, knees bent and tied to the chair legs, wrists lashed behind the backrest. The dominant straddles their lap, controlling depth and pace, the chair’s edges biting into skin as power shifts with every move.
立缚后入 (Standing Bound Doggy)  
Description: The submissive stands, bent at the waist, wrists tied to ankles with short chains. The dominant enters from behind, hands free to grip hair or spank, the restrictive posture forcing the submissive to balance on trembling legs.
仰首蒙眼 (Blindfolded仰首)  
Description: The submissive lies on their back, head tilted off the bed’s edge, blindfolded, with wrists tied beneath. The dominant stands above, using their mouth or penetrating from an inverted angle, the sensory deprivation amplifying every muffled gasp.
侧卧锁腿 (Side-Lying Leg Lock)  
Description: The submissive lies on their side, one leg bent and tied to their wrist behind their back, the other leg free or strapped to a spreader bar. The dominant spoons from behind, controlling access with slow, deliberate thrusts, the asymmetrical bind twisting the body into submission.
跪缚骑乘 (Kneeling Bound Ride)  
Description: The dominant sits on a chair, wrists unbound, while the submissive kneels astride their lap, hands tied behind their own back. Ankles may be tethered to the chair base. The submissive rocks or grinds, guided by the dominant’s hands or a crop’s sting.
倒挂束缚 (Inverted Suspension)  
Description: The submissive is suspended upside-down by ankle cuffs, head dangling, wrists tied to a lower bar. The dominant stands or kneels at eye level, using their mouth or hands, the blood rush and disorientation intensifying every touch.
壁缚直立 (Wall-Bound Standing)
Description: The submissive stands against a wall, wrists and ankles spread and shackled to anchors, forming a vertical X. The dominant presses against them, lifting a leg or penetrating directly, the cold wall contrasting with heated skin.
俯身台缚 (Table-Bent Bind)
Description: The submissive bends over a table, chest pressed flat, wrists tied to the far edge, ankles spread and cuffed to table legs. The dominant stands behind, delivering deep thrusts or teasing with a flogger, the hard surface amplifying each impact.
双人缠绳 (Dual Rope Wrap)
Description: Both partners face each other, torsos bound together with rope, wrists tied behind their own backs. Legs intertwine, forcing shallow, intimate thrusts. The shared restraint blurs dominance, every move a mutual struggle.
屈膝吊缚 (Knee-Bent Suspension)
Description: The submissive is suspended face-down, knees bent and tied to a harness, wrists pulled back to meet ankles. The dominant kneels beneath, entering or teasing from below, the rocking motion dictated by the ropes’ tension.
仰躺屈腿 (Supine Leg Bend)
Description: The submissive lies on their back, legs bent at the knees and pulled toward their chest, ankles tied to a spreader bar above. Wrists are lashed to the sides. The dominant kneels or stands, penetrating deeply, the exposed position offering no resistance.
伏地锁链 (Prone Chained)
Description: The submissive lies face-down on the floor, wrists and ankles chained to corner stakes, body stretched taut. The dominant mounts from above or behind, the cold floor and unyielding metal amplifying the sense of surrender with every thrust.