{
  "note": "以下为示例道具列表，AI可根据需求自行生成更多类似道具。(The following are example prop lists; the AI can generate additional similar props as needed.)",
  "categories": [
    {
      "name": "魔法饰品 (Magical Jewelry) - 融合魔法与美感的隐秘调教饰品 (Discreet training jewelry blending magic and aesthetics)",
      "items": [
        {
          "name": "月影项圈 (Moonshadow Collar)",
          "aliases": ["月光颈环 (Moonlight Neck Ring)", "影月饰 (Shadow Moon Ornament)", "隐秘锁喉 (Hidden Throat Lock)"],
          "description": "A delicate choker of silver filigree, studded with tiny moonstone beads that shimmer like liquid light. Worn as a fashionable necklace, it conceals a spell that tightens on command, pressing against the throat to enforce silence or submission, its glow pulsing with the master’s intent as a beautiful leash in disguise."
        },
        {
          "name": "星辉手镯 (Starglow Bracelet)",
          "aliases": ["星光腕饰 (Starlight Wrist Ornament)", "辉星扣 (Glowing Star Clasp)", "伪装腕锁 (Camouflaged Wrist Lock)"],
          "description": "A slender bangle of polished gold, engraved with constellations that sparkle faintly. A whispered incantation links two bracelets into invisible cuffs, binding the wrists with shimmering, unbreakable force, offering discreet restraint in public while radiating subtle pleasure through the skin."
        },
        {
          "name": "玫瑰戒指 (Rosebud Ring)",
          "aliases": ["玫红指环 (Rose Red Ring)", "花欲扣 (Flower Lust Clasp)", "隐秘惩戒 (Hidden Punishment)"],
          "description": "A dainty ring with a ruby carved into a blooming rose. It hides a punishment spell that heats with a sharp sting when activated, radiating phantom pain to sensitive areas, training obedience through subtle torment while maintaining its innocent floral charm."
        },
        {
          "name": "碧玺腰链 (Tourmaline Waist Chain)",
          "aliases": ["碧光腰饰 (Tourmaline Glow Belt)", "束身链 (Body-Binding Chain)", "伪装拘腰 (Camouflaged Waist Restraint)"],
          "description": "A thin chain of green tourmaline beads draped elegantly around the waist. With a snap of the master’s fingers, it contracts tightly, restricting movement or enforcing posture, blending beauty with covert control and delivering a gentle, pleasurable pressure."
        },
        {
          "name": "紫晶耳坠 (Amethyst Earrings)",
          "aliases": ["紫影耳饰 (Purple Shadow Earrings)", "晶灵坠 (Crystal Spirit Drops)", "调教耳扣 (Training Ear Clasps)"],
          "description": "Teardrop amethysts dangling from silver hooks, swaying with each step. When activated, they hum softly, flooding the mind with submissive whispers or lustful disorientation, conditioning the wearer with pleasurable mental fog during intimate sessions."
        },
        {
          "name": "黑曜石脚链 (Obsidian Anklet)",
          "aliases": ["黑晶踝饰 (Black Crystal Anklet)", "影步链 (Shadow Step Chain)", "隐形脚扣 (Invisible Foot Cuffs)"],
          "description": "A minimalist anklet of polished obsidian beads. Enchanted to extend shadowy tendrils that bind ankles together or tether them to a point, it hobbles the wearer discreetly under clothing, with a cool, tingling sensation enhancing the restrained pleasure."
        },
        {
          "name": "翡翠发簪 (Jade Hairpin)",
          "aliases": ["翠玉簪 (Emerald Jade Pin)", "发饰锁 (Hair Ornament Lock)", "伪装束发 (Camouflaged Hair Binder)"],
          "description": "A carved jade pin with floral etchings, securing hair elegantly. When tapped, it transforms into a flexible whip or binding cord, lashing flesh or tying limbs with a smooth, pleasurable sting, its beauty masking its disciplinary power."
        },
        {
          "name": "蓝宝石胸针 (Sapphire Brooch)",
          "aliases": ["蓝宝饰扣 (Sapphire Decorative Clasp)", "胸锁针 (Chest Lock Pin)", "调教心扣 (Heart Training Clasp)"],
          "description": "A star-shaped brooch with a deep blue sapphire center, pinned to clothing. It sends a chilling jolt through the chest when triggered, punishing defiance with a shiver that weakens resolve, while its gleam offers a deceptive innocence and a thrill of submission."
        },
        {
          "name": "琥珀吊坠 (Amber Pendant)",
          "aliases": ["琥光坠 (Amber Glow Pendant)", "暖魂饰 (Warm Soul Ornament)", "隐秘禁锢 (Hidden Confinement)"],
          "description": "A golden amber teardrop hanging from a fine chain, warm to the touch. It glows brighter when activated, releasing a magical warmth that binds the will, making resistance feel heavy and futile, while infusing the wearer with a submissive, pleasurable haze."
        },
        {
          "name": "珍珠指链 (Pearl Finger Chain)",
          "aliases": ["珠光指饰 (Pearl Glow Finger Ornament)", "手链扣 (Hand Chain Clasp)", "伪装指缚 (Camouflaged Finger Bind)"],
          "description": "A delicate chain linking a pearl ring to a bracelet, adorning the hand with grace. With a flick of the master’s wrist, it tightens into a finger restraint, locking hands in place or connecting to other bindings, delivering a soft, pleasurable tug with each restriction."
        },
        {
          "name": "红宝石脚环 (Ruby Anklet) - 新增 (New)",
          "aliases": ["红晶踝扣 (Red Crystal Ankle Clasp)", "焰步链 (Flame Step Chain)", "隐秘锁足 (Hidden Foot Lock)"],
          "description": "A slender anklet with small ruby gems that flicker like embers. Enchanted to heat slightly when activated, it binds the ankles with a firm, warm grip, restricting steps while sending waves of pleasurable heat up the legs, enforcing controlled movement."
        },
        {
          "name": "水晶颈链 (Crystal Necklace) - 新增 (New)",
          "aliases": ["晶光颈饰 (Crystal Glow Neckpiece)", "锁喉水饰 (Throat-Locking Water Ornament)", "伪装束颈 (Camouflaged Neck Bind)"],
          "description": "A necklace of clear quartz beads that refract light beautifully. When commanded, it tightens subtly around the neck, enforcing shallow breaths and submission, while a cool, tingling pleasure radiates from the crystals to reward obedience."
        },
        {
          "name": "玛瑙腕扣 (Agate Wrist Cuff) - 新增 (New)",
          "aliases": ["瑙石腕饰 (Agate Stone Wristpiece)", "隐扣腕锁 (Hidden Clasp Wrist Lock)", "调教腕带 (Training Wristband)"],
          "description": "A wide cuff of swirled agate stone, worn as a bold accessory. It locks the wrist in a rigid hold when triggered, restricting hand movement under the master’s will, with a deep, grounding pleasure pulsing through the stone."
        },
        {
          "name": "珊瑚耳环 (Coral Earrings) - 新增 (New)",
          "aliases": ["珊影耳饰 (Coral Shadow Earrings)", "海灵坠 (Sea Spirit Drops)", "隐秘耳缚 (Hidden Ear Bind)"],
          "description": "Branch-like coral earrings that sway gently. When activated, they emit a soft oceanic hum, binding the wearer’s thoughts to the master’s voice, while a wave-like pleasure washes over the ears and neck, deepening control."
        },
        {
          "name": "欧泊指环 (Opal Ring) - 新增 (New)",
          "aliases": ["虹光指饰 (Rainbow Glow Ring)", "幻欲扣 (Illusion Lust Clasp)", "伪装指控 (Camouflaged Finger Control)"],
          "description": "A ring with an iridescent opal that shifts colors with the light. When activated, it projects faint, hypnotic patterns into the wearer’s vision, binding their focus to the master’s commands, with a tingling pleasure spreading from the finger."
        }
      ]
    }
  ]
}