{"note":"以下为示例道具列表，AI可根据需求自行生成更多类似道具。(The following are example prop lists; the AI can generate additional similar props as needed.)","categories":[{"name":"性爱调教 (Sexual Training) - 用于强烈控制与快感增强的道具 (Props designed for intense control and pleasure enhancement)","items":[{"name":"纳米项圈 (Nano Collar)","description":"A sleek collar made of nanomaterial that adjusts tightness and delivers subtle electric pulses for control or pleasure."},{"name":"开口器和阳具棒 (Mouth Opener and Phallus Rod)","description":"A dual-purpose device; the opener holds the mouth ajar while the rod vibrates and releases aphrodisiac mist."},{"name":"可折叠的拘束箱 (Foldable Restraint Box)","description":"A portable box that unfolds into a full-body restraint cage with adjustable straps and stimulators."},{"name":"纳米级智能束缚带 (Nano Smart Restraint Strap)","description":"A self-adjusting strap that binds limbs, equipped with sensors to heighten sensation based on movement."},{"name":"量子锁链 (Quantum Chains)","description":"Chains that phase through objects to bind, glowing with energy and releasing neural shocks on contact."},{"name":"脑波同步头环 (Brainwave Sync Headband)","description":"A headband syncing brain activity to amplify pleasure or obedience via neural feedback."},{"name":"视觉诱导眼罩 (Visual Induction Blindfold)","description":"A blindfold projecting hypnotic visuals to induce submission or arousal."},{"name":"神经刺激贴片 (Neural Stimulation Patch)","description":"Small patches placed on skin, delivering targeted electric pulses to nerves for sensation control."},{"name":"体液循环装置 (Bodily Fluid Recycler)","description":"A wearable unit that collects and repurposes bodily fluids into energy or stimulants."},{"name":"姿态矫正骨架 (Posture Correction Frame)","description":"A lightweight exoskeleton locking the body into submissive poses with built-in vibrators."},{"name":"发声管理喉环 (Voice Control Throat Ring)","description":"A choker regulating vocal output, silencing or amplifying sounds with stimulation triggers."},{"name":"奴役之瞳耳环 (Eyes of Enslavement Earrings)","description":"Earrings emitting subliminal signals through sound waves to deepen loyalty."},{"name":"心魂指环 (Soul Heart Ring)","description":"A ring linking the wearer’s emotions to a controller, amplifying desire or devotion."},{"name":"魅魔蕾丝内衣 (Succubus Lace Lingerie)","description":"Lace lingerie with embedded micro-vibrators and pheromone dispensers for seduction."},{"name":"灵纱束缚带 (Ethereal Silk Restraint)","description":"A translucent silk band that tightens spiritually, enhancing sensitivity to touch."},{"name":"欲望猫尾肛塞 (Desire Cat Tail Anal Plug)","description":"A tail-shaped plug with a vibrating core that responds to vocal commands."},{"name":"支配颈环 (Domination Neck Ring)","description":"A sturdy ring enforcing obedience with heat and vibration based on resistance levels."},{"name":"虚空手铐 (Void Handcuffs)","description":"Invisible cuffs locking wrists in midair, using spatial distortion and electric tingles."},{"name":"欲望魔石 (Lust Magic Stone)","description":"A glowing gem channeling arousal energy, implantable or wearable for constant stimulation."},{"name":"控制魔石 (Control Magic Stone)","description":"A stone emitting commands via energy waves, overriding the wearer’s will."},{"name":"堕落烙印 (Mark of Corruption)","description":"A tattoo-like brand that heats up and stimulates when activated, encouraging submission."},{"name":"快感咒文 (Pleasure Incantation)","description":"Engraved runes on skin or gear, glowing to convert pain or effort into waves of ecstasy."},{"name":"情欲鞭锁 (Lust Whip Chains)","description":"A whip that doubles as a binding chain, releasing aphrodisiac oils when it strikes or coils."},{"name":"淫纹腰带 (Lewd Tattoo Belt)","description":"A belt with glowing runes that tighten around the waist, delivering vibrations to the hips and lower body."},{"name":"性瘾控制器 (Sex Addiction Controller)","description":"A palm-sized device syncing with implants to regulate arousal levels remotely."},{"name":"快感寄生装 (Pleasure Parasite Suit)","description":"A skin-tight suit mimicking a living organism, stimulating erogenous zones as it clings."},{"name":"催情脊椎植入物 (Aphrodisiac Spine Implant)","description":"A spinal strip injecting stimulants, heightening sensitivity with every motion."},{"name":"心跳束胸 (Heartbeat Corset)","description":"A corset syncing with the wearer’s pulse, tightening and teasing as heart rate rises."},{"name":"束缚蕾丝手套 (Lace Restraint Gloves)","description":"Elegant gloves that extend into binding threads, massaging palms with micro-vibrators."},{"name":"皮革束腕带 (Leather Wrist Strap)","description":"Simple leather cuffs with metal buckles, tightening manually to bind wrists with a rustic feel."},{"name":"丝绸蒙眼布 (Silk Blindfold)","description":"A soft silk cloth tied over the eyes, heightening anticipation through touch alone."},{"name":"羽毛鞭 (Feather Whip)","description":"A light whip with feather tips, delivering teasing tickles rather than pain."}]}]}